pc0808f/Taiwanduino/software/Arduino plugin/hardware/Arduino_taiwan/avr/boards.txt
# For more information see:
# - https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# - https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

##############################################################
#USB Programming
TaiwanArduino.name=Arduino Taiwan (USB)
TaiwanArduino.bootloader.tool=arduino:avrdude
TaiwanArduino.build.mcu=atmega328p
TaiwanArduino.build.f_cpu=16000000L
TaiwanArduino.build.core=arduino:arduino
TaiwanArduino.build.variant=arduino:eightanaloginputs
TaiwanArduino.build.board=AVR_PROTRINKET
TaiwanArduino.upload.tool=taiwan_arduino:avrdude
TaiwanArduino.upload.maximum_size=28672
TaiwanArduino.upload.speed=115200


##############################################################
#Serial/FTDI Programming 
TaiwanArduinoftdi.name=Arduino Taiwan (FTDI)
TaiwanArduinoftdi.bootloader.low_fuses=0xff
TaiwanArduinoftdi.bootloader.high_fuses=0xde
TaiwanArduinoftdi.bootloader.extended_fuses=0x05
TaiwanArduinoftdi.bootloader.file=optiboot/optiboot_atmega328.hex
TaiwanArduinoftdi.bootloader.unlock_bits=0x3F
TaiwanArduinoftdi.bootloader.lock_bits=0x0F
TaiwanArduinoftdi.bootloader.tool=arudino:avrdude
TaiwanArduinoftdi.build.mcu=atmega328p
TaiwanArduinoftdi.build.f_cpu=16000000L
TaiwanArduinoftdi.build.core=arduino:arduino
TaiwanArduinoftdi.build.variant=arduino:eightanaloginputs
TaiwanArduinoftdi.build.board=AVR_TaiwanArduinoFTDI
TaiwanArduinoftdi.upload.tool=arduino:avrdude
TaiwanArduinoftdi.upload.protocol=arduino
TaiwanArduinoftdi.upload.maximum_size=28672
TaiwanArduinoftdi.upload.speed=115200
